- Pandas is a open source python library for data manipulation and analysis.
- It is mainly used to work with relational or tabular data
- It is built on numpy library
- Pandas provide two data structures:data frame and series
- Series is 1D and has only one column which can have data of any type along with index
- Data frame is 2D and can have any number of columns

### loading,creating,structure,columns,index

In [1]:
import pandas as pd
import numpy as np

In [12]:
#reading data
df=pd.read_csv('DS1_C4_S5_Person_Data_Concept.csv')

- we can also read data from excel and other formats .for excel: pd.read_excel()
- separator can be used when we have data as single column with values separated by something like tab,semicolon etc:
  sep="t", sep=";" 
- we can use header when we dont have column names.by default 1st row is treated as columns. if we dont have column names then 1st row of actual data is treated as columns.to avoid this u can use header=none. if column name is somewhere else header=row number

In [18]:
idx=pd.Index([1,2,3,4])

In [19]:
idx.summary()

AttributeError: 'Int64Index' object has no attribute 'summary'

In [1293]:
#copying the dataframe:if we just do as df1=df , then changes made in df is also affected in df1
#so by copying we have the current state of df in df1. we dont care what happens to df later
df1=df.copy()

In [216]:
d = {
    "name": ["John Smith", "Jane Doe", "Bob Johnson"],
    "age": [30, 25, 35],
    "city": ["New York", "Los Angeles", "Chicago"]
}

In [217]:
#creating  dataframe from dictionary
#only works if values of dictionary are in list. d={"name":"akshay","age":30} doesnt work
df=pd.DataFrame(d)
df

          name  age         city
0   John Smith   30     New York
1     Jane Doe   25  Los Angeles
2  Bob Johnson   35      Chicago

In [218]:
#making dataframe ulta
df[::-1]

          name  age         city
2  Bob Johnson   35      Chicago
1     Jane Doe   25  Los Angeles
0   John Smith   30     New York

In [1296]:
#dataframe from lists:u can use below method or can also make it as a dictionary and then pass it.
df=pd.DataFrame()
l=[1,2,3,4]
v=[4,5,51,66]
c=[23,4,4,4]
df["l"]=l
df["v"]=v
df["c"]=c
df.head()

   l   v   c
0  1   4  23
1  2   5   4
2  3  51   4
3  4  66   4

In [1297]:
#checking first 3 data
df1.head(3)

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4

In [1298]:
#checking last 5 rows
df1.tail()

     Gender  Height  Weight  Index
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

- inplace parameter is used in many pandas operation. whatever changes we did on dataframe is updated in same if we use inplace=True. Else we need to store in some other dataframe after changes

In [1299]:
#renaming the columns:Gender as gender,Index as index.
df1.rename(columns={"Gender":"gender","Index":"index"},inplace=True)

In [1300]:
df1.head()

   gender  Height  Weight  index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3

In [1301]:
#getting column names
df1.columns

Index(['gender', 'Height', 'Weight', 'index'], dtype='object')

In [1302]:
#checking structure of dataframe:(row,column)
df.shape

(4, 3)

In [1303]:
#setting dataframe column as a index values
df1.set_index('Height',inplace=True)

In [1304]:
df1.head()

        gender  Weight  index
Height
174       Male      96      4
189       Male      87      2
185     Female     110      4
195     Female     104      3
149       Male      61      3

In [1305]:
#making index values as a column
df1.reset_index(inplace=True)
df1.head()

   Height  gender  Weight  index
0     174    Male      96      4
1     189    Male      87      2
2     185  Female     110      4
3     195  Female     104      3
4     149    Male      61      3

In [1306]:
#if index is not proper and u want to make it to default starting from 0
df1.reset_index(drop=True)

     Height  gender  Weight  index
0       174    Male      96      4
1       189    Male      87      2
2       185  Female     110      4
3       195  Female     104      3
4       149    Male      61      3
..      ...     ...     ...    ...
495     150  Female     153      5
496     184  Female     121      4
497     141  Female     136      5
498     150    Male      95      5
499     173    Male     131      5

[500 rows x 4 columns]

In [1307]:
#changing index as some other values
df1.index=[i for i in range(100,600)]
df1.head()

     Height  gender  Weight  index
100     174    Male      96      4
101     189    Male      87      2
102     185  Female     110      4
103     195  Female     104      3
104     149    Male      61      3

In [1308]:
#checking data types
df1.dtypes

Height     int64
gender    object
Weight     int64
index      int64
dtype: object

In [1309]:
#changing data types
df1["Height"]=df1["Height"].astype("float")

In [1310]:
df1.dtypes

Height    float64
gender     object
Weight      int64
index       int64
dtype: object

In [1311]:
#describing the numerical columns of data frame
df1.describe()

           Height      Weight       index
count  500.000000  500.000000  500.000000
mean   169.944000  106.000000    3.748000
std     16.375261   32.382607    1.355053
min    140.000000   50.000000    0.000000
25%    156.000000   80.000000    3.000000
50%    170.500000  106.000000    4.000000
75%    184.000000  136.000000    5.000000
max    199.000000  160.000000    5.000000

In [1312]:
#information about dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 500 entries, 100 to 599
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Height  500 non-null    float64
 1   gender  500 non-null    object
 2   Weight  500 non-null    int64
 3   index   500 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 19.5+ KB

### Data selection

In [1313]:
#iloc

In [1314]:
#getting one column
df1["Height"].head()

100    174.0
101    189.0
102    185.0
103    195.0
104    149.0
Name: Height, dtype: float64

In [1315]:
#getting multiple coulmns
df1[["Height","Weight"]].head()

     Height  Weight
100   174.0      96
101   189.0      87
102   185.0     110
103   195.0     104
104   149.0      61

In [1316]:
#data in first row
df1.iloc[0]

Height    174.0
gender     Male
Weight       96
index         4
Name: 100, dtype: object

In [1317]:
#data in row from 5 to 10
df1.iloc[5:10]

     Height  gender  Weight  index
105   189.0    Male     104      3
106   147.0    Male      92      5
107   154.0    Male     111      5
108   174.0    Male      90      3
109   169.0  Female     103      4

In [1318]:
#filtering data on index 3 to 6 as well as columns from 0 to 2
df1.iloc[3:6,0:2]

     Height  gender
103   195.0  Female
104   149.0    Male
105   189.0    Male

In [1319]:
df1.iloc[3,1]

'Female'

In [1320]:
#data for index 0 to 2 and for columns 1 and 3
df1.iloc[0:2,[1,3]]

    gender  index
100   Male      4
101   Male      2

In [1321]:
#loc

In [1322]:
#loc takes actual index values and column names unlike iloc where we just index based on their occurence
#like for example since my index starts from 100, in iloc if i say 0:5 this means first 5 rows
#but here i need to pass index values i.e. 100:105 for first 5 rows
#same for columns:i need to pass column names not in numbers as index

In [1323]:
df1.loc[100]

Height    174.0
gender     Male
Weight       96
index         4
Name: 100, dtype: object

In [1324]:
df1.loc[100:102]

     Height  gender  Weight  index
100   174.0    Male      96      4
101   189.0    Male      87      2
102   185.0  Female     110      4

In [1325]:
df1.loc[100:102,"Height"]

100    174.0
101    189.0
102    185.0
Name: Height, dtype: float64

In [1326]:
df1.loc[100:102,["Height","Weight"]]

     Height  Weight
100   174.0      96
101   189.0      87
102   185.0     110

In [1327]:
df1.loc[[100,102],["Height","Weight"]]

     Height  Weight
100   174.0      96
102   185.0     110

- loc is label based data selection method ,iloc is index based data selection method
- that means we need to pass actual index or column names for iloc for data selection and for iloc we need to pass index and not the actual values
- df.iloc[0:2] selects rows 0 and 1 while df.loc[0:2] selects rows 0,1 and 2 also

In [1328]:
#without using loc or iloc u can also do only slicing

In [1329]:
df1[0:2]

     Height gender  Weight  index
100   174.0   Male      96      4
101   189.0   Male      87      2

In [1330]:
#after slicing getting only 2 columns as we have learnt 
df1[0:2][["Height","Weight"]]

     Height  Weight
100   174.0      96
101   189.0      87

In [1331]:
#slicing but getting every 5th element:row indexing
df1[::5]

     Height  gender  Weight  index
100   174.0    Male      96      4
105   189.0    Male     104      3
110   195.0    Male      81      2
115   153.0  Female     107      5
120   157.0    Male     110      5
..      ...     ...     ...    ...
575   183.0    Male     131      4
580   155.0  Female     115      5
585   173.0    Male     111      4
590   164.0  Female      59      2
595   150.0  Female     153      5

[100 rows x 4 columns]

In [1332]:
#selecting columns based on data types

In [1333]:
df1.select_dtypes("object")

     gender
100    Male
101    Male
102  Female
103  Female
104    Male
..      ...
595  Female
596  Female
597  Female
598    Male
599    Male

[500 rows x 1 columns]

In [1334]:
#selecting only numericals
df1.select_dtypes(exclude="object")

     Height  Weight  index
100   174.0      96      4
101   189.0      87      2
102   185.0     110      4
103   195.0     104      3
104   149.0      61      3
..      ...     ...    ...
595   150.0     153      5
596   184.0     121      4
597   141.0     136      5
598   150.0      95      5
599   173.0     131      5

[500 rows x 3 columns]

### Filtering

In [1335]:
df1.head()

     Height  gender  Weight  index
100   174.0    Male      96      4
101   189.0    Male      87      2
102   185.0  Female     110      4
103   195.0  Female     104      3
104   149.0    Male      61      3

In [1336]:
#filtering one column 
df1[df1["Height"]>198]

     Height  gender  Weight  index
200   199.0    Male     156      4
260   199.0    Male      99      2
426   199.0  Female      92      2

In [1337]:
#filtering mutiple columns
df1[(df1["gender"]=="Male") & (df1["Weight"]>150)]

     Height gender  Weight  index
129   179.0   Male     152      5
149   140.0   Male     152      5
200   199.0   Male     156      4
202   161.0   Male     155      5
206   166.0   Male     160      5
207   159.0   Male     154      5
228   182.0   Male     151      5
257   168.0   Male     160      5
272   167.0   Male     151      5
299   193.0   Male     151      5
304   145.0   Male     160      5
311   148.0   Male     155      5
337   165.0   Male     155      5
387   178.0   Male     160      5
395   160.0   Male     156      5
406   183.0   Male     153      5
453   184.0   Male     153      5
483   151.0   Male     154      5
512   181.0   Male     154      5
535   168.0   Male     158      5
537   184.0   Male     157      5
550   162.0   Male     157      5
573   195.0   Male     153      5

In [1338]:
df1[df1["gender"].isin(["Male","male"])]

     Height gender  Weight  index
100   174.0   Male      96      4
101   189.0   Male      87      2
104   149.0   Male      61      3
105   189.0   Male     104      3
106   147.0   Male      92      5
..      ...    ...     ...    ...
587   187.0   Male      80      2
588   198.0   Male     136      4
594   152.0   Male      98      5
598   150.0   Male      95      5
599   173.0   Male     131      5

[245 rows x 4 columns]

### values

In [1339]:
#read csv
df=pd.read_csv('DS1_C4_S3_BigMarket_Data_Concept.csv')
df.head()

  Month Store  Sales
0   Jan     A  31037
1   Jan     B  20722
2   Jan     C  24557
3   Jan     D  34649
4   Jan     E  29795

In [1340]:
#seeing counts of  unique values
df["Month"].value_counts()

Jan      5
Feb      5
March    5
Apr      5
May      5
Name: Month, dtype: int64

In [1341]:
#unique values in column
df["Month"].unique()

array(['Jan', 'Feb', 'March', 'Apr', 'May'], dtype=object)

In [1342]:
#number of  unique values
df["Month"].nunique()

5

In [1343]:
#sorting in descending order of sales and changing the index as per order.
#if u want to sort first on sales,and then with some other column: just put them in list of priority ["Sales","Margins"]
df.sort_values("Sales",inplace=True,ascending=False,ignore_index=True)
df.head()

   Month Store  Sales
0  March     C  47814
1    May     E  47594
2    Apr     C  47488
3    May     C  46482
4    May     D  46313

In [1344]:
#total null values in each columns
df.isnull().sum()

Month    0
Store    0
Sales    0
dtype: int64

In [1345]:
#total null values in each rows:here just showing for first 3 rows
df.loc[0:2].isnull().sum(axis=1)

0    0
1    0
2    0
dtype: int64

In [1346]:
#? or null values in each row
#? in each columns

In [1347]:
#different mathematical functions and aggregate functions

In [1348]:
df["Sales"].sum(),df["Sales"].min(),df["Sales"].max(),df["Sales"].count()

(857961, 20722, 47814, 25)

In [1349]:
df["Sales"].mean(),df["Sales"].median(),df["Sales"].mode()[0]

(34318.44, 31874.0, 20722)

In [1350]:
df["Sales"].std(),df["Sales"].var()

(8604.098350398683, 74030508.42333333)

### deleting and updating data frame,getting null/noise values

In [1351]:
#dropping rows containing null values
df.dropna(inplace=True)

In [1352]:
#dropping columns.inplace=True can be used. 
df.drop(["Month","Sales"],axis=1)

   Store
0      C
1      E
2      C
3      C
4      D
5      E
6      B
7      B
8      D
9      D
10     E
11     A
12     E
13     D
14     A
15     E
16     A
17     A
18     C
19     A
20     B
21     D
22     C
23     B
24     B

In [1353]:
#dropping indexes
df.drop(index=[1,2,3,4,5,6,7,8])

    Month Store  Sales
0   March     C  47814
9     Jan     D  34649
10    Apr     E  33880
11  March     A  32961
12  March     E  31874
13    Feb     D  31454
14    Jan     A  31037
15    Jan     E  29795
16    May     A  29487
17    Feb     A  29133
18    Feb     C  28312
19    Apr     A  27253
20  March     B  26451
21    Apr     D  25432
22    Jan     C  24557
23    Feb     B  22695
24    Jan     B  20722

In [1354]:
#loading new dataset for further uses
df=pd.read_csv("DS1_C4_S4_Insurance_Data_Concept.csv")

In [1355]:
#finding duplicate rows in whole data
df[df.duplicated()]

Empty DataFrame
Columns: [patientid, dayofmonth, age, gender, bmi, bloodpressure, diabetic, children, smoker, region, claim]
Index: []

In [1356]:
#fiding duplicate rows wrt some columns only
#here wrt these 4 columns we can see all duplicate rows
df[df.duplicated(subset=["dayofmonth","age","gender","bmi"],keep=False)]

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
6,7,1,29,male,37.3,86,Yes,0,No,northwest,1141.45
9,10,1,29,male,37.3,86,Yes,0,No,northwest,1141.45
195,196,21,33,female,31.8,98,Yes,2,No,southeast,3056.39
576,577,5,44,female,28.7,88,No,3,No,northwest,8059.68
808,809,5,44,female,28.7,95,No,0,No,southwest,11455.28
835,836,21,33,female,31.8,95,No,0,No,northwest,11842.62

In [1357]:
#this gives only duplicate rows considering the first occured row as unique. that means only 3 rows are repeated
#keep =First as default.if last then last occurence is treated as unique
df[df.duplicated(subset=["dayofmonth","age","gender","bmi"])]

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
9,10,1,29,male,37.3,86,Yes,0,No,northwest,1141.45
808,809,5,44,female,28.7,95,No,0,No,southwest,11455.28
835,836,21,33,female,31.8,95,No,0,No,northwest,11842.62

In [1358]:
#dropping these duplicates
#u can also use subsets if u want to drop rows based on duplicates in set of columns
df.drop_duplicates(inplace=True)

In [1359]:
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,male,23.2,91,Yes,0,No,southeast,1121.87
1,2,8,24,male,30.1,87,No,0,No,southeast,1131.51
2,3,11,27,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,5,37,male,33.7,80,No,0,No,northwest,1136.40
4,5,21,30,male,34.1,100,No,0,No,northwest,1137.01

In [1360]:
#replacing male with Male
df.replace("male","Male",inplace=True)
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,Male,23.2,91,Yes,0,No,southeast,1121.87
1,2,8,24,Male,30.1,87,No,0,No,southeast,1131.51
2,3,11,27,Male,33.3,82,Yes,0,No,southeast,1135.94
3,4,5,37,Male,33.7,80,No,0,No,northwest,1136.40
4,5,21,30,Male,34.1,100,No,0,No,northwest,1137.01

In [1361]:
#replacing multiple values Male with male, No with no
df.replace({"Male":"male","No":"no"},inplace=True)
#or
#df.replace(["Male","No"],["male","no"],inplace=True)
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,male,23.2,91,Yes,0,no,southeast,1121.87
1,2,8,24,male,30.1,87,no,0,no,southeast,1131.51
2,3,11,27,male,33.3,82,Yes,0,no,southeast,1135.94
3,4,5,37,male,33.7,80,no,0,no,northwest,1136.40
4,5,21,30,male,34.1,100,no,0,no,northwest,1137.01

In [1362]:
#replacing on only one column
df["smoker"]=df["smoker"].replace("no","No")

In [1363]:
#replacing based on conditions:age>30 then replace bmi with 50
df.loc[(df["age"]>30)&(df["diabetic"]=="Yes"),"bmi"]=50
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,male,50.0,91,Yes,0,No,southeast,1121.87
1,2,8,24,male,30.1,87,no,0,No,southeast,1131.51
2,3,11,27,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,5,37,male,33.7,80,no,0,No,northwest,1136.40
4,5,21,30,male,34.1,100,no,0,No,northwest,1137.01

In [1364]:
#replacing first 2 rows of children with 1
df.loc[0:1,"children"]=1
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,male,50.0,91,Yes,1,No,southeast,1121.87
1,2,8,24,male,30.1,87,no,1,No,southeast,1131.51
2,3,11,27,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,5,37,male,33.7,80,no,0,No,northwest,1136.40
4,5,21,30,male,34.1,100,no,0,No,northwest,1137.01

In [1365]:
#replace function doesnt take conditions. it just replaces value with a value
#based on condition if u want to replace u can use this moethod or also use where,apply methods

In [1366]:
#just adding noise to data for trying some advanced methods
import numpy as np
df.loc[[0,3,2],["gender","children"]]=np.nan

In [1367]:
#we can see there are some null values
df.isnull().sum()

patientid        0
dayofmonth       0
age              0
gender           3
bmi              0
bloodpressure    0
diabetic         5
children         3
smoker           0
region           0
claim            3
dtype: int64

In [1368]:
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,NaN,50.0,91,Yes,NaN,No,southeast,1121.87
1,2,8,24,male,30.1,87,no,1.0,No,southeast,1131.51
2,3,11,27,NaN,33.3,82,Yes,NaN,No,southeast,1135.94
3,4,5,37,NaN,33.7,80,no,NaN,No,northwest,1136.40
4,5,21,30,male,34.1,100,no,0.0,No,northwest,1137.01

In [1369]:
#replace nan with mean of their respective columns for numerical column. for categorical column replacing with mode
for i in df:
    if df[i].dtypes=="object":
        df[i].replace(np.nan,df[i].mode()[0],inplace=True)
    else:
        df[i].replace(np.nan,df[i].mean(),inplace=True)

In [1370]:
df.isnull().sum()

patientid        0
dayofmonth       0
age              0
gender           0
bmi              0
bloodpressure    0
diabetic         0
children         0
smoker           0
region           0
claim            0
dtype: int64

In [1371]:
#replacing nan values with some values.we can also use this instead of replace function
df.fillna(0,inplace=True)

In [1372]:
#adding some noise 
df.loc[2:5,["children","dayofmonth"]]="?"

In [1373]:
df.head(7)

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,male,50.0,91,Yes,1.096485,No,southeast,1121.87
1,2,8,24,male,30.1,87,no,1.0,No,southeast,1131.51
2,3,?,27,male,33.3,82,Yes,?,No,southeast,1135.94
3,4,?,37,male,33.7,80,no,?,No,northwest,1136.40
4,5,?,30,male,34.1,100,no,?,No,northwest,1137.01
5,6,?,47,male,50.0,96,Yes,?,No,northwest,1137.47
6,7,1,29,male,37.3,86,Yes,0.0,No,northwest,1141.45

In [1374]:
# ? count for each columns
df.isin(["?"]).sum()

patientid        0
dayofmonth       4
age              0
gender           0
bmi              0
bloodpressure    0
diabetic         0
children         4
smoker           0
region           0
claim            0
dtype: int64

In [1375]:
# rows containing ?
df[df.isin(["?"]).sum(axis=1)>0]

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
2,3,?,27,male,33.3,82,Yes,?,No,southeast,1135.94
3,4,?,37,male,33.7,80,no,?,No,northwest,1136.40
4,5,?,30,male,34.1,100,no,?,No,northwest,1137.01
5,6,?,47,male,50.0,96,Yes,?,No,northwest,1137.47

In [1376]:
#this also works:rows containing ?
df[df.isin(["?"]).any(axis=1)]

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
2,3,?,27,male,33.3,82,Yes,?,No,southeast,1135.94
3,4,?,37,male,33.7,80,no,?,No,northwest,1136.40
4,5,?,30,male,34.1,100,no,?,No,northwest,1137.01
5,6,?,47,male,50.0,96,Yes,?,No,northwest,1137.47

In [1377]:
#dropping rows which contains ?
#this can also be used :  df.drop(df[df.isin(["?"]).any(axis=1)].index)
df.replace("?",np.nan,inplace=True)
df.dropna(inplace=True)

In [1378]:
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19.0,39,male,50.0,91,Yes,1.096485,No,southeast,1121.87
1,2,8.0,24,male,30.1,87,no,1.000000,No,southeast,1131.51
6,7,1.0,29,male,37.3,86,Yes,0.000000,No,northwest,1141.45
7,8,6.0,19,male,41.1,100,no,0.000000,No,northwest,1146.80
8,9,9.0,20,male,43.0,86,no,0.000000,No,northwest,1149.40

### Merging

In [1379]:
#reducing dataframe for easy understanding
df=df[["patientid","age","gender","smoker"]]

In [1380]:
l=np.random.randint(0,1000,1336)

In [1381]:
c1=np.random.randint(0,1000,1336)
c2=np.random.randint(0,1000,1336)

In [1382]:
df.reset_index(drop=True,inplace=True)

In [1383]:
df1=pd.DataFrame({"c1":c1,"c2":c2})
df1.head()

    c1   c2
0  652  429
1   55  351
2  772  407
3  849  558
4  304  469

In [1384]:
#adding new column to a dataframe
df["new"]=l

In [1385]:
#joining two dataframes side by side
pd.concat([df,df1],axis=1)

      patientid  age  gender smoker  new   c1   c2
0             1   39    male     No  208  652  429
1             2   24    male     No  826   55  351
2             7   29    male     No  733  772  407
3             8   19    male     No  697  849  558
4             9   20    male     No  376  304  469
...         ...  ...     ...    ...  ...  ...  ...
1331       1336   44  female    Yes  967  258  124
1332       1337   59  female    Yes  788  912  118
1333       1338   30    male    Yes  222  991  693
1334       1339   37    male    Yes  992  944  956
1335       1340   30  female    Yes  699  595  492

[1336 rows x 7 columns]

In [1386]:
df2=df.iloc[100:105]
df2

     patientid  age  gender smoker  new
100        105   52  female     No  249
101        106   43  female     No  561
102        107   42  female     No  831
103        108   33    male     No  802
104        109   26  female     No  228

In [1387]:
#adding a new row to a dataframe :horizontally
df.loc[len(df)]=['105','52','female','No','524']

In [1388]:
df.tail()

     patientid age  gender smoker  new
1332      1337  59  female    Yes  788
1333      1338  30    male    Yes  222
1334      1339  37    male    Yes  992
1335      1340  30  female    Yes  699
1336       105  52  female     No  524

In [1389]:
#adding mutiple rows to a dataframe i.e. concating two dataframes horizontally 
df=pd.concat([df,df2])

In [1390]:
df.head()

  patientid age gender smoker  new
0         1  39   male     No  208
1         2  24   male     No  826
2         7  29   male     No  733
3         8  19   male     No  697
4         9  20   male     No  376

In [1391]:
#loading new datasets for demonstrating merging
cust=pd.read_excel("DS1_C4_S4_ECommerce_Data_Concept.xlsx",sheet_name=0)
order=pd.read_excel("DS1_C4_S4_ECommerce_Data_Concept.xlsx",sheet_name=1)

In [1392]:
cust.head()

  Cust_ID  Age  Gender     City
0  Cust_1   35    Male   Mumbai
1  Cust_2   24  Female  Chennai
2  Cust_3   20  Female    Delhi
3  Cust_4   45    Male  Chennai
4  Cust_5   37    Male   Mumbai

In [1393]:
order.head()

   Ord_ID Cust_ID  Ord_quantity    Sales Ord_priority
0  Ord_10  Cust_1           4.0  3237.00       Medium
1  Ord_14  Cust_2           NaN      NaN          NaN
2  Ord_25  Cust_3           2.0   422.70          Low
3  Ord_29  Cust_4          15.0  4571.79         High
4  Ord_34  Cust_5           8.0  4233.15          Low

In [1394]:
#merging based on column columns
#types of merging:how :left,right,outer,inner,cross

In [1395]:
pd.merge(cust,order,left_on="Cust_ID",right_on="Cust_ID",how="inner")

  Cust_ID  Age  Gender     City  Ord_ID  Ord_quantity    Sales Ord_priority
0  Cust_1   35    Male   Mumbai  Ord_10           4.0  3237.00       Medium
1  Cust_2   24  Female  Chennai  Ord_14           NaN      NaN          NaN
2  Cust_3   20  Female    Delhi  Ord_25           2.0   422.70          Low
3  Cust_4   45    Male  Chennai  Ord_29          15.0  4571.79         High
4  Cust_5   37    Male   Mumbai  Ord_34           8.0  4233.15          Low
5  Cust_6   40  Female   Mumbai  Ord_52           3.0   164.02         High

### groupby,pivot_table,crosstab

In [3]:
#loading new dataset for further uses
df=pd.read_csv("DS1_C4_S4_Insurance_Data_Concept.csv")

In [4]:
df.head()

,patientid,dayofmonth,age,gender,bmi,bloodpressure,diabetic,children,smoker,region,claim
0,1,19,39,male,23.2,91,Yes,0,No,southeast,1121.87
1,2,8,24,male,30.1,87,No,0,No,southeast,1131.51
2,3,11,27,male,33.3,82,Yes,0,No,southeast,1135.94
3,4,5,37,male,33.7,80,No,0,No,northwest,1136.40
4,5,21,30,male,34.1,100,No,0,No,northwest,1137.01

In [1404]:
#groupby gender and apply mean on that group for numerical columns
df.groupby("gender").mean()

,patientid,dayofmonth,age,bmi,bloodpressure,children,claim
gender,,,,,,,
female,667.667674,15.640483,42.483384,30.379758,94.013595,1.074018,12535.402572
male,673.265487,14.662242,33.746313,30.928024,94.281711,1.112094,13838.573047

In [1412]:
#applying different aggregate functions on different columns
#for mode: you can also use:    "diabetic":pd.Series.mode
df.groupby("gender").agg({"bmi":"mean","age":"median","smoker":"count","diabetic":lambda x:x.mode()[0]})

              bmi   age  smoker diabetic
gender
female  30.379758  43.0     662       No
male    30.928024  34.0     678       No

In [1417]:
df.groupby("children")["bloodpressure"].mean().sort_values(ascending=False)

children
2    94.662500
1    94.506173
0    94.164931
3    93.273885
4    92.960000
5    89.666667
Name: bloodpressure, dtype: float64

In [1418]:
#pivot table

In [6]:
pd.pivot_table(data=df,index="gender",columns="smoker",values=["bmi"],aggfunc=["mean","median",lambda x:x.mode()[0] ])

             mean            median       <lambda>
              bmi               bmi            bmi
smoker         No        Yes     No   Yes       No   Yes
gender
female  30.540585  29.614783   30.2  28.4     33.3  23.7
male    30.750482  31.507547   30.5  31.1     27.6  29.8

In [1432]:
#getting row and column values :margin values also means overall for that column aswell for rows
pd.pivot_table(data=df,index="gender",columns="smoker",values=["bmi"],aggfunc=["mean"],margins=True)

             mean
              bmi
smoker         No        Yes        All
gender
female  30.540585  29.614783  30.379758
male    30.750482  31.507547  30.928024
All     30.642777  30.713139  30.657164

In [1433]:
# crosstab

In [1439]:
pd.crosstab(index=df["gender"],columns=df["smoker"])

smoker   No  Yes
gender
female  547  115
male    519  159

In [1452]:
pd.crosstab(index=df["gender"],columns=df["smoker"],margins=True)

smoker    No  Yes   All
gender
female   547  115   662
male     519  159   678
All     1066  274  1340

In [1449]:
#normalizing crosstab for all 4 types
pd.crosstab(index=df["gender"],columns=df["smoker"],normalize=True)

smoker        No       Yes
gender
female  0.408209  0.085821
male    0.387313  0.118657

In [1447]:
#normalize for each column i.e. out of smoker/non how much percentage are male and female
#for row wise:  normalize="index"
pd.crosstab(index=df["gender"],columns=df["smoker"],normalize='columns')

smoker        No       Yes
gender
female  0.513133  0.419708
male    0.486867  0.580292

In [ ]:
#groupby() is used to group rows of data and apply an aggregate function, 
#while pivot_table() is used to create a summary table that shows the relationship between multiple variables.
#crosstab is used to create contingency table or frequency table

### complex dataframe manipulations using apply,map ,str,cut,melt

In [ ]:
#unpivoting the table or columns using melt function

In [12]:
>>> df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
...                    'B': {0: 1, 1: 3, 2: 5},
...                    'C': {0: 2, 1: 4, 2: 6}})

In [13]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [14]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [15]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [ ]:
#map function in pandas

In [20]:
df=pd.DataFrame()
df["name"]=["aa","bb","cc","dd","ee","ff"]
df["gender"]=["m","f","f","m","m","m"]
df

  name gender
0   aa      m
1   bb      f
2   cc      f
3   dd      m
4   ee      m
5   ff      m

In [23]:
df["gender"]=df["gender"].map({"m":1,"f":0})

In [24]:
df

  name  gender
0   aa       1
1   bb       0
2   cc       0
3   dd       1
4   ee       1
5   ff       1

In [25]:
#apply function

In [26]:
#splitting a name into first and second name

In [36]:
df=pd.DataFrame()

In [37]:
df['name']=["virat kohli","suresh raina","chris gayle"]

In [30]:
df

           name
0   virat kohli
1  suresh raina
2   chris gayle

In [41]:
df["first_name"]=df["name"].apply(lambda x:x.split(" ")[0])

In [40]:
df["second_name"]=df["name"].apply(lambda x:x.split(" ")[1])

In [42]:
df

           name second_name first_name
0   virat kohli       kohli      virat
1  suresh raina       raina     suresh
2   chris gayle       gayle      chris

In [ ]:
#str functions

In [44]:
df["name"]=df["name"].str.upper()

In [45]:
df

           name second_name first_name
0   VIRAT KOHLI       kohli      virat
1  SURESH RAINA       raina     suresh
2   CHRIS GAYLE       gayle      chris

In [ ]:
#str.contains method

In [70]:
#filter if text contains numbers

In [101]:
df=pd.DataFrame()
df["text"]=["dwed","aks3","s1d2fd","t6gg","dfdf"]
df

     text
0    dwed
1    aks3
2  s1d2fd
3    t6gg
4    dfdf

In [106]:
#by default regex will be on , so we can mathc patterns using regular expression also using this
df[df["text"].str.contains("[0-9]")]

     text
1    aks3
2  s1d2fd
3    t6gg

In [107]:
#just negate this to get only pure text values
df[~df["text"].str.contains("[0-9]")]

   text
0  dwed
4  dfdf

In [ ]:
#if string contains mumbai or bombay then yes

In [79]:
df=pd.DataFrame()
df["stadium"]=["chinnaswamy bangalore","wankhede bombay","mumbai local stadium","delhi indoor","hyderabad stadium"]
df

                 stadium
0  chinnaswamy bangalore
1        wankhede bombay
2   mumbai local stadium
3           delhi indoor
4      hyderabad stadium

In [87]:
df["stadium"].str.contains("mumbai|bombay")

0    False
1     True
2     True
3    False
4    False
Name: stadium, dtype: bool

In [46]:
#from name get gender column

In [48]:
df=pd.DataFrame()
df["name"]=["Mr Adf","Mr Bdf","Ms Cassd"]
df

       name
0    Mr Adf
1    Mr Bdf
2  Ms Cassd

In [50]:
df["gender"]=df["name"].apply(lambda x:"Male" if x.split()[0]=="Mr" else "Female")

In [51]:
df

       name  gender
0    Mr Adf    Male
1    Mr Bdf    Male
2  Ms Cassd  Female

In [ ]:
#separate a mixed column into numbers and characters

In [12]:
df = pd.DataFrame({'registration_id': ['a12', 'ab12', 't567']})
df

  registration_id
0             a12
1            ab12
2            t567

In [7]:
# extract characters 
df['registration_id'].str.extract('([a-zA-Z]+)')

    0
0   a
1  ab
2   t

In [9]:
#ectracting numbers:
df["registration_id"].str.extract('(\d+)')

     0
0   12
1   12
2  567

In [14]:
#lets combine both logic and make two columns
df[["characters","numbers"]]=df["registration_id"].str.extract('([a-zA-Z]+)(\d+)')
df

  registration_id characters numbers
0             a12          a      12
1            ab12         ab      12
2            t567          t     567

In [52]:
#making continuos into discrete

In [61]:
df=pd.DataFrame()
df["salary"]=[100,200,300,250,500,150,600,350]
df

   salary
0     100
1     200
2     300
3     250
4     500
5     150
6     600
7     350

In [55]:
#salary >=500:high,<=250:low,else normal

In [62]:
def fun(x):
    if x>=500:
        return "high"
    elif x<=250:
        return "low"
    else:
        return "normal"

In [63]:
df["bracket"]=df["salary"].apply(fun)

In [64]:
df

   salary bracket
0     100     low
1     200     low
2     300  normal
3     250     low
4     500    high
5     150     low
6     600    high
7     350  normal

In [65]:
#cut method for equal size bins

In [66]:
df=pd.DataFrame()
df["salary"]=[100,200,300,250,500,150,600,350]
df

   salary
0     100
1     200
2     300
3     250
4     500
5     150
6     600
7     350

In [68]:
df["bracket"]=pd.cut(df["salary"],bins=3,labels=["low","normal","high"])

In [69]:
df

   salary bracket
0     100     low
1     200     low
2     300  normal
3     250     low
4     500    high
5     150     low
6     600    high
7     350  normal

In [190]:
#converting a column of list into set of features i.e breaking down a list
df=pd.DataFrame()
df["name"]=["a","b","c","d","e"]
df["age"]=[20,19,18,17,16]
df["feature"]=[["study","sports"],["sing","dance"],["study"],["dance"],["sing"]]
df

  name  age          feature
0    a   20  [study, sports]
1    b   19    [sing, dance]
2    c   18          [study]
3    d   17          [dance]
4    e   16           [sing]

In [197]:
#if i use explode on this it breaks the list but output is not what i want
df.explode("feature")

  name  age feature
0    a   20   study
0    a   20  sports
1    b   19    sing
1    b   19   dance
2    c   18   study
3    d   17   dance
4    e   16    sing

In [199]:
#if i use dummies on explode this is how i get. see its repeating so i will group by 
pd.get_dummies(df['feature'].explode())

   dance  sing  sports  study
0      0     0       0      1
0      0     0       1      0
1      0     1       0      0
1      1     0       0      0
2      0     0       0      1
3      1     0       0      0
4      0     1       0      0

In [192]:
#final code
#this can also be done using multilable binarizer present in sklearn.preprocessing
df1=pd.get_dummies(df['feature'].explode()).groupby(level=0).sum()
df1

   dance  sing  sports  study
0      0     0       1      1
1      1     1       0      0
2      0     0       0      1
3      1     0       0      0
4      0     1       0      0

In [195]:
pd.concat([df[["name","age"]],df1],axis=1)

  name  age  dance  sing  sports  study
0    a   20      0     0       1      1
1    b   19      1     1       0      0
2    c   18      0     0       0      1
3    d   17      1     0       0      0
4    e   16      0     1       0      0

### looping over a dataframe

In [178]:
a = pd.DataFrame({'IPL Team':['CSK','SRH','KKR','RR','MI','RCB','KXIP','DD'],'Matches Played':[16,17,16,15,14,14,14,14],'Matches Won':[11,10,9,7,6,6,6,5]})

In [155]:
a

  IPL Team  Matches Played  Matches Won
0      CSK              16           11
1      SRH              17           10
2      KKR              16            9
3       RR              15            7
4       MI              14            6
5      RCB              14            6
6     KXIP              14            6
7       DD              14            5

In [156]:
for i in a:
    print(i)

IPL Team
Matches Played
Matches Won

In [158]:
for i in a:
    if i=="IPL Team":
        print(a[i])

0     CSK
1     SRH
2     KKR
3      RR
4      MI
5     RCB
6    KXIP
7      DD
Name: IPL Team, dtype: object

In [167]:
for i,j in a.iterrows():
    print(i)
    print(j)
    print("-"*20)

0
IPL Team          CSK
Matches Played     16
Matches Won        11
Name: 0, dtype: object
--------------------
1
IPL Team          SRH
Matches Played     17
Matches Won        10
Name: 1, dtype: object
--------------------
2
IPL Team          KKR
Matches Played     16
Matches Won         9
Name: 2, dtype: object
--------------------
3
IPL Team          RR
Matches Played    15
Matches Won        7
Name: 3, dtype: object
--------------------
4
IPL Team          MI
Matches Played    14
Matches Won        6
Name: 4, dtype: object
--------------------
5
IPL Team          RCB
Matches Played     14
Matches Won         6
Name: 5, dtype: object
--------------------
6
IPL Team          KXIP
Matches Played      14
Matches Won          6
Name: 6, dtype: object
--------------------
7
IPL Team          DD
Matches Played    14
Matches Won        5
Name: 7, dtype: object
--------------------

In [173]:
#accessing a single value for row and column pair
#this also helps in replacing value at that place
a.at[0,"IPL Team"]

'CSK'

In [179]:
a.at[0,"IPL Team"]="csk"

In [180]:
a

  IPL Team  Matches Played  Matches Won
0      csk              16           11
1      SRH              17           10
2      KKR              16            9
3       RR              15            7
4       MI              14            6
5      RCB              14            6
6     KXIP              14            6
7       DD              14            5

In [ ]:
#looping over with iterrows and replacing elements

In [186]:
for i,j in a.iterrows():
    c="Matches Played"
    if a.loc[i,c]>14:
        a.at[i,c]="selected"

In [187]:
a

  IPL Team Matches Played  Matches Won
0      csk       selected           11
1      SRH       selected           10
2      KKR       selected            9
3       RR       selected            7
4       MI             14            6
5      RCB             14            6
6     KXIP             14            6
7       DD             14            5

### Converting one type to another

1. List to numpy array

In [115]:
l=[10,20,30]
a=np.array(l)
a

array([10, 20, 30])

2. numpy array to list

In [116]:
a=np.array([1,2,3])
a.tolist()

[1, 2, 3]

3. list or numpy array to Series

In [121]:
a=np.array([10,20,30])
pd.Series(a)

0    10
1    20
2    30
dtype: int32

4. list or array to dataframe column

In [122]:
l=[10,20,30]
pd.DataFrame(l)

    0
0  10
1  20
2  30

5. Dictionary to dataframe

In [124]:
d={"a":[1,2,3],"b":[4,5,6]}
pd.DataFrame(d)

   a  b
0  1  4
1  2  5
2  3  6

6. Nested list to dataframe

In [125]:
l=[[1,2,3],[4,5,6],[7,8,9]]
l

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [126]:
pd.DataFrame(l)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

7. Series to dataframe

In [130]:
s=pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [134]:
s.to_frame(name="num")

   num
0   10
1   20
2   30

8. multi dimensional numpy array to dataframe

In [137]:
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
a

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [138]:
pd.DataFrame(a)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

9. Series to numpy array and list

In [139]:
s=pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [140]:
s.to_numpy()

array([1, 2, 3], dtype=int64)

In [141]:
s.to_list()

[1, 2, 3]

10. DataFrame to numpy array and dictionary and nested lists

In [145]:
df=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
df

   a  b
0  1  4
1  2  5
2  3  6

In [147]:
df.to_numpy()

array([[1, 4],
       [2, 5],
       [3, 6]], dtype=int64)

In [149]:
df.to_dict()

{'a': {0: 1, 1: 2, 2: 3}, 'b': {0: 4, 1: 5, 2: 6}}

### Series

In [7]:
s=pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [201]:
type(s)

pandas.core.series.Series

In [203]:
#changing index of series
s.index=["a","b","c"]
s

a    1
b    2
c    3
dtype: int64

In [204]:
#defining index while creating series
s=pd.Series([1,2,3],index=np.arange(10,13))
s

10    1
11    2
12    3
dtype: int64

In [207]:
#series from dictionary
d={"a":1,"b":2,"c":3}
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [237]:
cust_id=["a1","a2","a3","a4","a5","a6","a7","a8"]
score=np.random.randint(1,100,8)
s=pd.Series(data=score,index=cust_id)
s

a1    71
a2    92
a3    31
a4    61
a5    14
a6    43
a7    43
a8    12
dtype: int32

In [210]:
#just the values of series
s.values

array([ 6, 26, 67, 80, 60, 47,  8, 98])

In [211]:
#filtering
s[s>50]

a3    67
a4    80
a5    60
a8    98
dtype: int32

In [212]:
s[0]

6

In [213]:
#reversing
s[::-1]

a8    98
a7     8
a6    47
a5    60
a4    80
a3    67
a2    26
a1     6
dtype: int32

In [219]:
#indexing
s[:3]

a1     6
a2    26
a3    67
dtype: int32

In [220]:
#index whose values greater than 50
s[s>50].index

Index(['a3', 'a4', 'a5', 'a8'], dtype='object')

In [238]:
#changing value
s=s+1
s

a1    72
a2    93
a3    32
a4    62
a5    15
a6    44
a7    44
a8    13
dtype: int32

In [222]:
s

a1     7
a2    27
a3    68
a4    81
a5    61
a6    48
a7     9
a8    99
dtype: int32

In [225]:
#filtering
s[s.between(30,100)]

a3    68
a4    81
a5    61
a6    48
a8    99
dtype: int32

In [239]:
#dropping
s.drop("a1")

a2    93
a3    32
a4    62
a5    15
a6    44
a7    44
a8    13
dtype: int32

In [240]:
#concating
s1=pd.Series([99,98],index=['a9','a10'])
s=pd.concat([s,s1])
s

a1     72
a2     93
a3     32
a4     62
a5     15
a6     44
a7     44
a8     13
a9     99
a10    98
dtype: int64

In [242]:
#updating a series
s.update(pd.Series([101,201],index=["a9","a10"]))

In [243]:
s

a1      72
a2      93
a3      32
a4      62
a5      15
a6      44
a7      44
a8      13
a9     101
a10    201
dtype: int64

In [247]:
#soring based on values
s.sort_values(ascending=False)

a10    201
a9     101
a2      93
a1      72
a4      62
a6      44
a7      44
a3      32
a5      15
a8      13
dtype: int64

In [248]:
#sorting based on index
s.sort_index()

a1      72
a10    201
a2      93
a3      32
a4      62
a5      15
a6      44
a7      44
a8      13
a9     101
dtype: int64